01  WS-AREA-1 PIC 9(7) VALUE ZEROES.
01  WS-AREA-2 PIC 9(7) VALUE ZEROES.
01  WS-AREA-3 PIC 9(7) VALUE ZEROES.

PROCEDURE DIVISION.
    ADD 1 TO WS-AREA-1.
    IF WS-AREA-1 > 9999999 THEN
        DISPLAY "ERROR: WS-AREA-1 overflow"
        MOVE ZEROES TO WS-AREA-3
        GO TO END-PROCESS
    END-IF.
    ADD WS-AREA-1 TO WS-AREA-2.
    IF WS-AREA-2 > 9999999 THEN
        DISPLAY "ERROR: WS-AREA-2 overflow"
        MOVE ZEROES TO WS-AREA-3
        GO TO END-PROCESS
    END-IF.
    MOVE WS-AREA-2 TO WS-AREA-3
    DISPLAY WS-AREA-3

END-PROCESS.
    STOP RUN.